{"the": 2, ".": 3, "of": 4, ",": 5, ")": 6, "(": 7, "to": 8, "in": 9, "is": 10, "that": 11, "and": 12, "by": 13, "a": 14, "section": 15, "no": 16, "housing": 17, "project": 18, "as": 19, "be": 20, "10": 21, "was": 22, "-": 23, "2005": 24, "80": 25, "ib": 26, "under": 27, "with": 28, "it": 29, "2015": 30, "which": 31, "&": 32, "out": 33, "on": 34, "this": 35, "not": 36, "commercial": 37, "from": 38, "c": 39, "'": 40, "projects": 41, "appeal": 42, "are": 43, "civil": 44, "or": 45, "arising": 46, "slp": 47, "for": 48, "local": 49, "1": 50, "such": 51, "would": 52, "deduction": 53, "04": 54, "we": 55, "approved": 56, "01": 57, "/": 58, "act": 59, "page\u00a0": 60, "court": 61, "33": 62, "d": 63, "were": 64, "provision": 65, "24330": 66, "2011": 67, "these": 68, "ors": 69, "page": 70, "ors.": 71, "has": 72, "authority": 73, "clause": 74, "residential": 75, "tax": 76, "also": 77, "area": 78, "high": 79, "have": 80, "4": 81, "had": 82, "said": 83, "before": 84, "user": 85, "income": 86, "year": 87, "law": 88, "up": 89, "all": 90, "amendment": 91, "effect": 92, "prior": 93, "date": 94, "revenue": 95, "any": 96, "after": 97, "other": 98, "assessee": 99, "assessment": 100, "2": 101, "profits": 102, "sub": 103, "built": 104, "3": 105, "31": 106, "authorities": 107, "%": 108, "at": 109, "time": 110, "only": 111, ":": 112, "aforesaid": 113, "been": 114, "sanctioned": 115, "shops": 116, "construction": 117, "therefore": 118, "assessees": 119, "even": 120, "case": 121, "an": 122, "when": 123, "if": 124, "where": 125, "permitted": 126, "cannot": 127, "applied": 128, "further": 129, "5": 130, "within": 131, "rules": 132, "he": 133, "courts": 134, "though": 135, "there": 136, "completed": 137, "condition": 138, "extent": 139, "approval": 140, "entitled": 141, "however": 142, "thus": 143, "\u201c": 144, "one": 145, "necessary": 146, "special": 147, "st": 148, "unit": 149, "18": 150, "but": 151, "conditions": 152, "view": 153, "statute": 154, "concerned": 155, "made": 156, "establishments": 157, "having": 158, "units": 159, "legislature": 160, "s": 161, "benefit": 162, "taken": 163, "same": 164, "order": 165, "those": 166, "per": 167, "feet": 168, "whichever": 169, "words": 170, "6": 171, "filed": 172, "given": 173, "dc": 174, "14": 175, "principle": 176, "2013": 177, "appeals": 178, "because": 179, "fact": 180, "could": 181, "inserted": 182, "they": 183, "judgment": 184, "particular": 185, "v": 186, ";": 187, "b": 188, "size": 189, "argument": 190, "expressly": 191, "rights": 192, "accrued": 193, "right": 194, "petitioners": 195, "charge": 196, "sheet": 197, "leave": 198, "question": 199, "derived": 200, "provided": 201, "may": 202, "some": 203, "new": 204, "finance": 205, "into": 206, "first": 207, "03": 208, "above": 209, "clear": 210, "aggregate": 211, "earlier": 212, "since": 213, "issue": 214, "development": 215, "stood": 216, "cities": 217, "learned": 218, "17": 219, "then": 220, "restriction": 221, "25": 222, "their": 223, "cases": 224, "building": 225, "holding": 226, "itself": 227, "2000": 228, "much": 229, "prospective": 230, "stipulated": 231, "started": 232, "discussion": 233, "available": 234, "purpose": 235, "judgments": 236, "7": 237, "provisions": 238, "following": 239, "delhi": 240, "argued": 241, "our": 242, "brought": 243, "19": 244, "i": 245, "2014": 246, "claimed": 247, "100": 248, "undertaking": 249, "previous": 250, "relevant": 251, "no.": 252, "mentioned": 253, "can": 254, "certain": 255, "applicable": 256, "developers": 257, "municipal": 258, "treated": 259, "like": 260, "against": 261, "9": 262, "basis": 263, "day": 264, "commenced": 265, "thousand": 266, "square": 267, "five": 268, "limits": 269, "tribunal": 270, "allowable": 271, "do": 272, "hence": 273, "its": 274, "position": 275, "completion": 276, "force": 277, "implication": 278, "xx": 279, "15": 280, "away": 281, "should": 282, "21": 283, "without": 284, "so": 285, "permissible": 286, "take": 287, "sq.ft": 288, "saved": 289, "investigation": 290, "report": 291, "commissioner": 292, "mumbai": 293, "m": 294, "different": 295, "short": 296, "respect": 297, "contained": 298, "carried": 299, "amended": 300, "whether": 301, "common": 302, "?": 303, "pointed": 304, "purposes": 305, "various": 306, "establishment": 307, "specified": 308, "8": 309, "expression": 310, "dated": 311, "29": 312, "march": 313, "plot": 314, "maximum": 315, "once": 316, "regulations": 317, "upto": 318, "prescribed": 319, "part": 320, "counsel": 321, "find": 322, "already": 323, "dates": 324, "16": 325, "scc": 326, "unless": 327, "return": 328, "loss": 329, "forward": 330, "set": 331, "retrospectively": 332, "hand": 333, "approve": 334, "stated": 335, "22": 336, "24": 337, "2001": 338, "accorded": 339, "thereafter": 340, "balconies": 341, "linked": 342, "a.y": 343, "criminal": 344, "final": 345, "builders": 346, "u": 347, "e": 348, "years": 349, "raised": 350, "referred": 351, "identical": 352, "developing": 353, "introduced": 354, "w.e.f": 355, "2004": 356, "come": 357, "nature": 358, "scenario": 359, "answered": 360, "limit": 361, "constructed": 362, "sanction": 363, "vide": 364, "exceed": 365, "sq": 366, "less": 367, "5000": 368, "held": 369, "answer": 370, "meaning": 371, "reason": 372, "acts": 373, "well": 374, "\u201chousing": 375, "prevailing": 376, "manner": 377, "bombay": 378, "inasmuch": 379, "including": 380, "hundred": 381, "cent": 382, "1998": 383, "situated": 384, "activity": 385, "accepted": 386, "very": 387, "noted": 388, "irrespective": 389, "plus": 390, "11": 391, "period": 392, "mr": 393, "senior": 394, "us": 395, "13": 396, "contrast": 397, "ltd": 398, "include": 399, "required": 400, "losses": 401, "vested": 402, "23": 403, "being": 404, "does": 405, "did": 406, "cardinal": 407, "2003": 408, "sq.ft.": 409, "changes": 410, "projections": 411, "comply": 412, "april": 413, "06": 414, "1922": 415, "repealing": 416, "agency": 417, "r": 418, "cr.p.c": 419, "167": 420, "india": 421, "appellate": 422, "jurisdiction": 423, "w": 424, "subject": 425, "namely": 426, "covered": 427, "satisfied": 428, "point": 429, "book": 430, "insofar": 431, "amendments": 432, "dispute": 433, "down": 434, "effective": 435, "1961": 436, "avail": 437, "while": 438, "laws": 439, "finished": 440, "mention": 441, "interpretation": 442, "matter": 443, "need": 444, "admissible": 445, "still": 446, "defined": 447, "entire": 448, "petitions": 449, "itr": 450, "project\u201d": 451, "undertaken": 452, "land": 453, "minimum": 454, "impugned": 455, "context": 456, "dcrs": 457, "follows": 458, "30": 459, "respective": 460, "justified": 461, "present": 462, "retrospective": 463, "para": 464, "mean": 465, "direction": 466, "particularly": 467, "thereof": 468, "12": 469, "read": 470, "pertaining": 471, "notwithstanding": 472, "retrospectivity": 473, "limited": 474, "reliance": 475, "jute": 476, "industries": 477, "otherwise": 478, "filing": 479, "who": 480, "submitted": 481, "mind": 482, "reasons": 483, "departure": 484, "upon": 485, "dealt": 486, "known": 487, "contend": 488, "merely": 489, "deny": 490, "way": 491, "conclusion": 492, "higher": 493, "20": 494, "affairs": 495, "complete": 496, "his": 497, "paragraph": 498, "making": 499, "either": 500, "behind": 501}